In [18]:
import pandas as pd
import numpy as np

In [2]:
personInfo={
    'registrationNo':['L1f16bscs0093','lf16bscs0094','l1f16bscs0095','l1f16bscs0043','l1f16bscs0045','l1f16bscs0048','l1f16bscs0098'],
    'name':['m umer sohail khan','narmeen azhar','iqra kafayat','bilal khan','saqib','nauman','qadeer khan'],
    'age':[27,25,24,24,25,26,29]
}
dfInfo=pd.DataFrame(personInfo)

In [3]:
dfInfo

  registrationNo                name  age
0  L1f16bscs0093  m umer sohail khan   27
1   lf16bscs0094       narmeen azhar   25
2  l1f16bscs0095        iqra kafayat   24
3  l1f16bscs0043          bilal khan   24
4  l1f16bscs0045               saqib   25
5  l1f16bscs0048              nauman   26
6  l1f16bscs0098         qadeer khan   29

In [4]:
filt=(dfInfo['age']==24) | (dfInfo['age']==25)
dfInfo.loc[filt,'name']

1    narmeen azhar
2     iqra kafayat
3       bilal khan
4            saqib
Name: name, dtype: object

In [5]:
age=[24,25,25]
filt=dfInfo['age'].isin(age)
dfInfo.loc[filt]

  registrationNo           name  age
1   lf16bscs0094  narmeen azhar   25
2  l1f16bscs0095   iqra kafayat   24
3  l1f16bscs0043     bilal khan   24
4  l1f16bscs0045          saqib   25

In [6]:
filt =dfInfo['name'].str.contains('khan')
dfInfo.loc[filt]

  registrationNo                name  age
0  L1f16bscs0093  m umer sohail khan   27
3  l1f16bscs0043          bilal khan   24
6  l1f16bscs0098         qadeer khan   29

In [7]:
dfInfo.columns=['RegistrationNo','FullName','Age']

In [8]:
dfInfo.columns

Index(['RegistrationNo', 'FullName', 'Age'], dtype='object')

In [9]:
dfInfo.columns=[x.capitalize() for x in dfInfo.columns]
dfInfo.columns=dfInfo.columns.str.replace('Registrationno','RegistrationNo')
dfInfo.rename(columns={'Fullname':'FullName'},inplace=True)

In [10]:
dfInfo['FullName']=dfInfo['FullName'].str.title()
dfInfo['RegistrationNo']=dfInfo['RegistrationNo'].str.upper()

In [11]:
dfInfo.loc[1,'RegistrationNo']='L1F16BSCS0094'

In [12]:
def editName(FullName):
    if 'Khan' in FullName:
        return FullName.replace('Khan','Pathan')
    else:
        return FullName
dfInfo['FullName']= dfInfo['FullName'].apply(editName)

In [13]:
dfInfo.apply(len)
len(dfInfo)

7

In [14]:
# dfInfo.applymap(len)
# dfInfo.applymap(str.lower)
# dfInfo['FullName'].map({'Saqib':'saqib bhatti'})
dfInfo['FullName']=dfInfo['FullName'].replace({'Saqib':'saqib bhatti'})

In [15]:
# 29 min
# apply
# applymap
# map

In [16]:
#sorting
# dfInfo.sort_values(by='FullName',ascending=False)
# dfInfo.sort_values(by=['FullName','RegistrationNo'],ascending=False)
dfInfo.sort_index()

  RegistrationNo              FullName  Age
0  L1F16BSCS0093  M Umer Sohail Pathan   27
1  L1F16BSCS0094         Narmeen Azhar   25
2  L1F16BSCS0095          Iqra Kafayat   24
3  L1F16BSCS0043          Bilal Pathan   24
4  L1F16BSCS0045          saqib bhatti   25
5  L1F16BSCS0048                Nauman   26
6  L1F16BSCS0098         Qadeer Pathan   29

In [25]:
people={
    'first' :['corey','jane','john','chris',np.nan,None,'NA'],
    'last':['schafer','doe','doe','schafer',np.nan,np.nan,'Missing'],
    'email':['coreyschafer@gmail.com','janedoe@gmail.com','johndoe@gmail.com',None,np.nan,'anonymous@gmail.com',np.nan],
    'age':['33','55','63','36',None,None,'Missing']
}

peopleDf=pd.DataFrame(people)

In [34]:
peopleDf

   first     last                   email   age
0  corey  schafer  coreyschafer@gmail.com    33
1   jane      doe       janedoe@gmail.com    55
2   john      doe       johndoe@gmail.com    63
3  chris  schafer                    None    36
4    NaN      NaN                     NaN  None
5   None      NaN     anonymous@gmail.com  None
6     NA      NaN                     NaN   NaN

In [36]:
# peopleDf.replace('Missing',np.nan,inplace=True)
# peopleDf.dropna()
# peopleDf.dropna(how='all')
# peopleDf.dropna(how='any',subset=['email'])
peopleDf.fillna(0)

   first     last                   email age
0  corey  schafer  coreyschafer@gmail.com  33
1   jane      doe       janedoe@gmail.com  55
2   john      doe       johndoe@gmail.com  63
3  chris  schafer                       0  36
4      0        0                       0   0
5      0        0     anonymous@gmail.com   0
6     NA        0                       0   0

In [37]:
type(np.nan)

float

In [40]:
peopleDf.dtypes

first    object
last     object
email    object
age      object
dtype: object